В папке subsid (shared/homeworks/python_ds_miniprojects/5_subsid) находятся файлы (tm_sales_1, tm_sales_2, ...) с продажами продуктов через телемаркетинг. Каждый файл содержит, как минимум, 4 колонки (поля): FILIAL_ID, SUBS_ID, PROD_ID, ACT_DTTM.
Суть задачи в том, чтобы проверить подключения продуктов определенным пользователям, соединив файлы о продажах с логами по подключениям в системе.
Особенности данных:

сотрудники телемаркетинга не всегда указывают полный id, если 'id' нет в начале SUBS_ID, то нужно его добавить
поля в файлах могут быть расположены абсолютно случайным образом, но названия полей статичны
продажа не засчитывается, если отключение (END_DTTM) произошло меньше чем через 5 минут после подключения (START_DTTM)
если в файле с продажами встречается строка без указанного SUBS_ID, она пропускается
Сохраните результат в csv файл с разделителем ;, содержащий корректные подключения.

Note: обратите внимание на то, как pandas переводит дату из строки, возможно вам понадобится параметр format

Пример содержания итогового файла (колонка difference это разница между START_DTTM и END_DTTM):

ACT_DTTM;FILIAL_ID;difference
20-03-2020 14:59;1;255 days 09:01:00

In [1]:
path = '/mnt/HC_Volume_18315164/home-jupyter/jupyter-i-kazantseva-40/shared/homeworks/python_ds_miniprojects/5_subsid/subsid'

In [2]:
import pandas as pd
import os

In [3]:
folder_data = os.listdir(path)
folder_data

['prod_activations_logs.csv',
 'tm_sales_1.csv',
 'tm_sales_2.csv',
 'tm_sales_3.csv']

In [4]:
df = []
for i in folder_data:
    path_to_file = path + '/' + i
    df.append(path_to_file)
df

['/mnt/HC_Volume_18315164/home-jupyter/jupyter-i-kazantseva-40/shared/homeworks/python_ds_miniprojects/5_subsid/subsid/prod_activations_logs.csv',
 '/mnt/HC_Volume_18315164/home-jupyter/jupyter-i-kazantseva-40/shared/homeworks/python_ds_miniprojects/5_subsid/subsid/tm_sales_1.csv',
 '/mnt/HC_Volume_18315164/home-jupyter/jupyter-i-kazantseva-40/shared/homeworks/python_ds_miniprojects/5_subsid/subsid/tm_sales_2.csv',
 '/mnt/HC_Volume_18315164/home-jupyter/jupyter-i-kazantseva-40/shared/homeworks/python_ds_miniprojects/5_subsid/subsid/tm_sales_3.csv']

In [5]:
tm_sales_1 = pd.read_csv(df[1], sep=';', parse_dates=['ACT_DTTM'])
tm_sales_1.head()

     SUBS_ID  FILIAL_ID  PROD_ID            ACT_DTTM
0  id4651830          1     1954 2020-03-20 14:59:00
1    7646509          5     6431 2020-03-19 13:00:00
2  id7412683          4     3313 2020-03-22 17:25:00

In [6]:
tm_sales_1.shape

(3, 4)

In [7]:
tm_sales_1.dtypes

SUBS_ID              object
FILIAL_ID             int64
PROD_ID               int64
ACT_DTTM     datetime64[ns]
dtype: object

In [8]:
tm_sales_2 = pd.read_csv(df[2], sep=';', parse_dates=['ACT_DTTM'])
tm_sales_2.head()

   FILIAL_ID    SUBS_ID  PROD_ID            ACT_DTTM
0          3  id5416547     1743 2020-03-17 10:17:00
1          4        NaN     7421 2020-12-03 11:25:00
2          7    8362218     9879 2020-05-03 11:42:00
3          2    2185490     3210 2020-03-16 16:28:00

In [9]:
tm_sales_2.shape

(4, 4)

In [10]:
tm_sales_2.dtypes

FILIAL_ID             int64
SUBS_ID              object
PROD_ID               int64
ACT_DTTM     datetime64[ns]
dtype: object

In [11]:
tm_sales_3 = pd.read_csv(df[3], sep=';', parse_dates=['ACT_DTTM'])
tm_sales_3.head()

   FILIAL_ID  PROD_ID    SUBS_ID            ACT_DTTM
0          3     1499  id5764122 2020-03-18 15:44:00
1          6     3020  id7642700 2020-03-15 14:21:00
2          2     5677  id1374509 2020-03-17 11:48:00

In [12]:
tm_sales_3.dtypes

FILIAL_ID             int64
PROD_ID               int64
SUBS_ID              object
ACT_DTTM     datetime64[ns]
dtype: object

In [13]:
tm_sales_3.shape

(3, 4)

In [14]:
tm_sales = tm_sales_1.append(tm_sales_2)

In [15]:
tm_sales = tm_sales.append(tm_sales_3)

In [16]:
tm_sales

     SUBS_ID  FILIAL_ID  PROD_ID            ACT_DTTM
0  id4651830          1     1954 2020-03-20 14:59:00
1    7646509          5     6431 2020-03-19 13:00:00
2  id7412683          4     3313 2020-03-22 17:25:00
0  id5416547          3     1743 2020-03-17 10:17:00
1        NaN          4     7421 2020-12-03 11:25:00
2    8362218          7     9879 2020-05-03 11:42:00
3    2185490          2     3210 2020-03-16 16:28:00
0  id5764122          3     1499 2020-03-18 15:44:00
1  id7642700          6     3020 2020-03-15 14:21:00
2  id1374509          2     5677 2020-03-17 11:48:00

In [17]:
tm_sales.shape

(10, 4)

In [18]:
tm_sales = tm_sales.dropna()

In [19]:
tm_sales.shape

(9, 4)

In [20]:
def concat_id(string):
    if 'id' not in string:
        string = 'id' + string
    return string

In [21]:
tm_sales.SUBS_ID = tm_sales.SUBS_ID.apply(concat_id)

/opt/tljh/user/lib/python3.7/site-packages/pandas/core/generic.py:5165: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [22]:
tm_sales

     SUBS_ID  FILIAL_ID  PROD_ID            ACT_DTTM
0  id4651830          1     1954 2020-03-20 14:59:00
1  id7646509          5     6431 2020-03-19 13:00:00
2  id7412683          4     3313 2020-03-22 17:25:00
0  id5416547          3     1743 2020-03-17 10:17:00
2  id8362218          7     9879 2020-05-03 11:42:00
3  id2185490          2     3210 2020-03-16 16:28:00
0  id5764122          3     1499 2020-03-18 15:44:00
1  id7642700          6     3020 2020-03-15 14:21:00
2  id1374509          2     5677 2020-03-17 11:48:00

In [23]:
prod_activations_logs = pd.read_csv(df[0], sep=';')
prod_activations_logs

     SUBS_ID  PROD_ID        START_DTTM          END_DTTM
1  id4651830     1954  20-03-2020 14:59  01-12-2020 00:00
5  id7646509     6431  19-03-2020 13:00  19-03-2020 13:03
2  id7461794     3310  20-03-2020 17:25  01-12-2020 00:00
3  id5416547     1743  17-03-2020 10:17  25-03-2020 11:00
4  id8238421     1859  01-03-2020 11:42  01-03-2020 11:43
3  id8641743     2752  20-03-2020 15:44  21-04-2020 15:44
2  id2185490     3210  16-03-2020 16:28  01-12-2020 00:00
6  id7642700     3020  15-03-2020 14:21  15-03-2020 23:42
2  id8741631     5677  19-03-2020 12:28  01-12-2020 00:00

In [24]:
tm_sales = tm_sales.merge(prod_activations_logs, how='inner')

In [25]:
tm_sales

,SUBS_ID,FILIAL_ID,PROD_ID,ACT_DTTM,START_DTTM,END_DTTM
0,id4651830,1,1954,2020-03-20 14:59:00,20-03-2020 14:59,01-12-2020 00:00
1,id7646509,5,6431,2020-03-19 13:00:00,19-03-2020 13:00,19-03-2020 13:03
2,id5416547,3,1743,2020-03-17 10:17:00,17-03-2020 10:17,25-03-2020 11:00
3,id2185490,2,3210,2020-03-16 16:28:00,16-03-2020 16:28,01-12-2020 00:00
4,id7642700,6,3020,2020-03-15 14:21:00,15-03-2020 14:21,15-03-2020 23:42

In [26]:
tm_sales.dtypes

SUBS_ID               object
FILIAL_ID              int64
PROD_ID                int64
ACT_DTTM      datetime64[ns]
START_DTTM            object
END_DTTM              object
dtype: object

In [27]:
tm_sales['START_DTTM'] = pd.to_datetime(tm_sales['START_DTTM'], dayfirst=True)

In [28]:
tm_sales['END_DTTM'] = pd.to_datetime(tm_sales['END_DTTM'], dayfirst=True)

In [29]:
tm_sales.dtypes

SUBS_ID               object
FILIAL_ID              int64
PROD_ID                int64
ACT_DTTM      datetime64[ns]
START_DTTM    datetime64[ns]
END_DTTM      datetime64[ns]
dtype: object

In [30]:
tm_sales['difference'] = tm_sales['END_DTTM'] - tm_sales['START_DTTM']

In [31]:
tm_sales

,SUBS_ID,FILIAL_ID,PROD_ID,ACT_DTTM,START_DTTM,END_DTTM,difference
0,id4651830,1,1954,2020-03-20 14:59:00,2020-03-20 14:59:00,2020-12-01 00:00:00,255 days 09:01:00
1,id7646509,5,6431,2020-03-19 13:00:00,2020-03-19 13:00:00,2020-03-19 13:03:00,0 days 00:03:00
2,id5416547,3,1743,2020-03-17 10:17:00,2020-03-17 10:17:00,2020-03-25 11:00:00,8 days 00:43:00
3,id2185490,2,3210,2020-03-16 16:28:00,2020-03-16 16:28:00,2020-12-01 00:00:00,259 days 07:32:00
4,id7642700,6,3020,2020-03-15 14:21:00,2020-03-15 14:21:00,2020-03-15 23:42:00,0 days 09:21:00

In [32]:
tm_sales.difference >= '5m'

0     True
1    False
2     True
3     True
4     True
Name: difference, dtype: bool

In [33]:
tm_sales = tm_sales.query("difference >= '5m'")
tm_sales

,SUBS_ID,FILIAL_ID,PROD_ID,ACT_DTTM,START_DTTM,END_DTTM,difference
0,id4651830,1,1954,2020-03-20 14:59:00,2020-03-20 14:59:00,2020-12-01 00:00:00,255 days 09:01:00
2,id5416547,3,1743,2020-03-17 10:17:00,2020-03-17 10:17:00,2020-03-25 11:00:00,8 days 00:43:00
3,id2185490,2,3210,2020-03-16 16:28:00,2020-03-16 16:28:00,2020-12-01 00:00:00,259 days 07:32:00
4,id7642700,6,3020,2020-03-15 14:21:00,2020-03-15 14:21:00,2020-03-15 23:42:00,0 days 09:21:00

In [34]:
tm_sales.to_csv('tm_sales_true', sep=';')

In [36]:
tm_sales = tm_sales \
    .sort_values(['SUBS_ID'], ascending=True)
tm_sales

,SUBS_ID,FILIAL_ID,PROD_ID,ACT_DTTM,START_DTTM,END_DTTM,difference
3,id2185490,2,3210,2020-03-16 16:28:00,2020-03-16 16:28:00,2020-12-01 00:00:00,259 days 07:32:00
0,id4651830,1,1954,2020-03-20 14:59:00,2020-03-20 14:59:00,2020-12-01 00:00:00,255 days 09:01:00
2,id5416547,3,1743,2020-03-17 10:17:00,2020-03-17 10:17:00,2020-03-25 11:00:00,8 days 00:43:00
4,id7642700,6,3020,2020-03-15 14:21:00,2020-03-15 14:21:00,2020-03-15 23:42:00,0 days 09:21:00